TheZeroHz/ESP32CSI_Vision/src/cam/ESP32P4_Isp.cpp
#include "cam/ESP32P4_Isp.h"

#include <Arduino.h>
#include <math.h>
#include <string.h>

#include "cam/ESP32P4_Camera.h"
#include "cam/ESP32P4_Ipa.h"
#include "driver/isp_ae.h"
#include "driver/isp_awb.h"
#include "driver/isp_bf.h"
#include "driver/isp_ccm.h"
#include "driver/isp_color.h"
#include "driver/isp_demosaic.h"
#include "driver/isp_gamma.h"
#include "driver/isp_lsc.h"
#include "driver/isp_sharpen.h"
#if __has_include("driver/isp_hist.h")
#include "driver/isp_hist.h"
#endif
#if __has_include("driver/isp_blc.h")
#include "driver/isp_blc.h"
#endif
#if __has_include("driver/isp_af.h")
#include "driver/isp_af.h"
#endif
#include "esp_heap_caps.h"
#include "hal/isp_ll.h"

#ifndef ESP32P4_ISP_3A_MS
#define ESP32P4_ISP_3A_MS 80
#endif

static float s_gamma_e = 0.55f;

static uint32_t gamma_curve(uint32_t x) {
  if (x >= 256) return 256;
  float n = (float)x / 256.0f;
  float y = powf(n, s_gamma_e) * 256.0f;
  if (y > 255.0f) y = 255.0f;
  return (uint32_t)(y + 0.5f);
}

static void u8_to_fixed17(uint8_t v, uint32_t *integer, uint32_t *decimal) {
  if (v >= 128) {
    *integer = 1;
    *decimal = (uint32_t)(v - 128);
    if (*decimal > 127) *decimal = 127;
  } else {
    *integer = 0;
    *decimal = (uint32_t)v * 127 / 128;
  }
}

static void f_to_fixed(float v, uint32_t ibits, uint32_t dbits, uint32_t *i, uint32_t *d) {
  if (v < 0.f) v = 0.f;
  const uint32_t imax = (1u << ibits) - 1u;
  const uint32_t dmax = (1u << dbits);
  uint32_t ii = (uint32_t)v;
  uint32_t dd = (uint32_t)((v - (float)ii) * (float)dmax + 0.5f);
  if (dd >= dmax) {
    ii++;
    dd = 0;
  }
  if (ii > imax) {
    ii = imax;
    dd = dmax - 1u;
  }
  *i = ii;
  *d = dd;
}

static uint32_t lsc_grids(uint32_t res) {
  if (res < 2) return 2;
  return (res - 1u) / 2u / (uint32_t)ISP_LL_LSC_GRID_HEIGHT + 2u;
}

static float lsc_unpack(uint16_t p) {
  return (float)((p >> 8) & 3) + (float)(p & 0xff) / 256.f;
}

static isp_lsc_gain_t lsc_pack(float f) {
  isp_lsc_gain_t g = {};
  if (f < 0.f) f = 0.f;
  if (f > 3.996f) f = 3.996f;
  uint32_t i = (uint32_t)f;
  uint32_t d = (uint32_t)((f - (float)i) * 256.f + 0.5f);
  if (d >= 256) {
    i++;
    d = 0;
  }
  if (i > 3) {
    i = 3;
    d = 255;
  }
  g.integer = i;
  g.decimal = d;
  return g;
}

bool IRAM_ATTR ESP32P4_Isp::onAwb(isp_awb_ctlr_t, const esp_isp_awb_evt_data_t *edata, void *ctx) {
  auto *self = (ESP32P4_Isp *)ctx;
  if (!self || !edata) return false;
  self->_white_n = edata->awb_result.white_patch_num;
  self->_sum_r = edata->awb_result.sum_r;
  self->_sum_g = edata->awb_result.sum_g;
  self->_sum_b = edata->awb_result.sum_b;
#if ISP_AWB_WINDOW_X_NUM > 0 && ISP_AWB_WINDOW_Y_NUM > 0
  const isp_awb_subwin_stat_result_t &sw = edata->awb_result.subwin_result;
  for (int y = 0; y < ISP_AWB_WINDOW_Y_NUM; y++) {
    for (int x = 0; x < ISP_AWB_WINDOW_X_NUM; x++) {
      self->_sw_n[x][y] = sw.white_patch_num[x][y];
      self->_sw_r[x][y] = sw.sum_r[x][y];
      self->_sw_g[x][y] = sw.sum_g[x][y];
      self->_sw_b[x][y] = sw.sum_b[x][y];
    }
  }
#endif
  self->_awb_fresh = 1;
  return false;
}

bool IRAM_ATTR ESP32P4_Isp::onAe(isp_ae_ctlr_t, const esp_isp_ae_env_detector_evt_data_t *edata,
                                void *ctx) {
  auto *self = (ESP32P4_Isp *)ctx;
  if (!self || !edata) return false;
  for (int y = 0; y < ISP_AE_BLOCK_Y_NUM; y++) {
    for (int x = 0; x < ISP_AE_BLOCK_X_NUM; x++) {
      int v = edata->ae_result.luminance[x][y];
      if (v < 0) v = 0;
      if (v > 255) v = 255;
      self->_ae_luma[x][y] = (uint8_t)v;
    }
  }
  self->_ae_fresh = 1;
  return false;
}

#if __has_include("driver/isp_hist.h")
bool IRAM_ATTR ESP32P4_Isp::onHist(isp_hist_ctlr_t, const esp_isp_hist_evt_data_t *edata, void *ctx) {
  auto *self = (ESP32P4_Isp *)ctx;
  if (!self || !edata) return false;
  for (int i = 0; i < 16 && i < ISP_HIST_SEGMENT_NUMS; i++) {
    self->_hist_bin[i] = edata->hist_result.hist_value[i];
  }
  self->_hist_fresh = 1;
  return false;
}
#endif

bool ESP32P4_Isp::begin(isp_proc_handle_t proc, uint16_t w, uint16_t h,
                        esp32p4_cam_sensor_t sensor) {
  end();
  if (!proc || w < 16 || h < 16) return false;
  _proc = proc;
  _w = w;
  _h = h;
  _sensor = sensor;
  _ipa = esp32p4_ipa_profile(sensor);
  _rgain = 1.0f;
  _bgain = 1.0f;
  _ct = 5000.f;
  _manual_once = false;
  _lsc_idx = 0xffff;
  _blc_key = 0xffff;
  _blc_skip = false;
  _env_luma = 0;
  if (_ipa) {
    if (!_ae_user) _ae_target = _ipa->ae_target;
    _contrast = _ipa->contrast;
    _saturation = _ipa->sat;
    _gamma = _ipa->gamma;
    _denoise = _ipa->bf_level ? _ipa->bf_level : 4;
  }
  if (!startBlocks()) {
    end();
    return false;
  }
  (void)applyLsc(_ct);
  (void)applyBlc(1.f);
  return true;
}

void ESP32P4_Isp::end() {
  stopAe();
  stopAwb();
  stopHist();
  stopAf();
  freeLsc();
  if (_proc) {
#if __has_include("driver/isp_blc.h")
    if (_blc_on) (void)esp_isp_blc_disable(_proc);
#endif
    (void)esp_isp_sharpen_disable(_proc);
    (void)esp_isp_gamma_disable(_proc);
    (void)esp_isp_color_disable(_proc);
    (void)esp_isp_ccm_disable(_proc);
    (void)esp_isp_bf_disable(_proc);
  }
  _proc = nullptr;
  _ipa = nullptr;
  _blc_on = false;
  _blc_skip = false;
}

void ESP32P4_Isp::freeLsc() {
  if (_proc && _lsc_on) {
    (void)esp_isp_lsc_disable(_proc);
  }
  _lsc_on = false;
  if (_lsc_arr.gain_r) {
    heap_caps_free(_lsc_arr.gain_r);
    _lsc_arr.gain_r = nullptr;
  }
  if (_lsc_arr.gain_gr) {
    heap_caps_free(_lsc_arr.gain_gr);
    _lsc_arr.gain_gr = nullptr;
  }
  if (_lsc_arr.gain_gb) {
    heap_caps_free(_lsc_arr.gain_gb);
    _lsc_arr.gain_gb = nullptr;
  }
  if (_lsc_arr.gain_b) {
    heap_caps_free(_lsc_arr.gain_b);
    _lsc_arr.gain_b = nullptr;
  }
  _lsc_n = 0;
}

const char *ESP32P4_Isp::profileName() const { return _ipa && _ipa->name ? _ipa->name : "none"; }

bool ESP32P4_Isp::startBlocks() {
  if (!applyBf()) return false;

  if (_ipa) {
    esp_isp_demosaic_config_t dm = {};
    dm.padding_mode = ISP_DEMOSAIC_EDGE_PADDING_MODE_SRND_DATA;
    uint32_t gi = 1, gd = 8;
    f_to_fixed(_dm_grad, ISP_DEMOSAIC_GRAD_RATIO_INT_BITS, ISP_DEMOSAIC_GRAD_RATIO_DEC_BITS, &gi,
               &gd);
    dm.grad_ratio.integer = gi;
    dm.grad_ratio.decimal = gd;
    (void)esp_isp_demosaic_configure(_proc, &dm);
  }

