TheZeroHz/ESP32CSI_Vision/src/cam/ESP32P4_Isp.cpp
  if (!applyCcm()) return false;
  if (esp_isp_ccm_enable(_proc) != ESP_OK) return false;

  if (!applyColor()) return false;
  if (esp_isp_color_enable(_proc) != ESP_OK) return false;

  if (!applyGamma()) {
    Serial.println("CSI: ISP gamma configure failed");
  }

  (void)applySharpen();

  if (_awb_on && !startAwb()) Serial.println("CSI: ISP AWB start failed (continuing)");
  if (_ae_on && !startAe()) Serial.println("CSI: ISP AE start failed (continuing)");
  if (!startHist()) Serial.println("CSI: ISP hist start failed (continuing)");
  return true;
}

bool ESP32P4_Isp::applyColor() {
  if (!_proc) return false;
  esp_isp_color_config_t c = {};
  uint32_t ci = 0, cd = 0, si = 0, sd = 0;
  u8_to_fixed17(_contrast, &ci, &cd);
  u8_to_fixed17(_saturation, &si, &sd);
  c.color_contrast.integer = ci;
  c.color_contrast.decimal = cd;
  c.color_saturation.integer = si;
  c.color_saturation.decimal = sd;
  c.color_hue = _hue > 360 ? 360 : _hue;
  c.color_brightness = _brightness;
  return esp_isp_color_configure(_proc, &c) == ESP_OK;
}

bool ESP32P4_Isp::applyGamma() {
  if (!_proc) return false;
  s_gamma_e = _gamma > 0.15f ? _gamma : 0.55f;
  isp_gamma_curve_points_t pts = {};
  if (esp_isp_gamma_fill_curve_points(gamma_curve, &pts) != ESP_OK) return false;
  if (esp_isp_gamma_configure(_proc, COLOR_COMPONENT_R, &pts) != ESP_OK) return false;
  if (esp_isp_gamma_configure(_proc, COLOR_COMPONENT_G, &pts) != ESP_OK) return false;
  if (esp_isp_gamma_configure(_proc, COLOR_COMPONENT_B, &pts) != ESP_OK) return false;
  return esp_isp_gamma_enable(_proc) == ESP_OK;
}

bool ESP32P4_Isp::applyCcm() {
  if (!_proc) return false;
  float m[9] = {1.f, 0.f, 0.f, 0.f, 1.f, 0.f, 0.f, 0.f, 1.f};
  if (_ccm_user) {
    memcpy(m, _ccm_m, sizeof(m));
  } else {
    if (_ipa) esp32p4_ipa_interp_ccm(_ipa, _ct, _last_luma, m);
    const float rg = _rgain * _user_rgain;
    const float bg = _bgain * _user_bgain;
    m[0] *= rg;
    m[3] *= rg;
    m[6] *= rg;
    m[2] *= bg;
    m[5] *= bg;
    m[8] *= bg;
  }
  esp_isp_ccm_config_t ccm = {};
  ccm.saturation = true;
  ccm.matrix[0][0] = m[0];
  ccm.matrix[0][1] = m[1];
  ccm.matrix[0][2] = m[2];
  ccm.matrix[1][0] = m[3];
  ccm.matrix[1][1] = m[4];
  ccm.matrix[1][2] = m[5];
  ccm.matrix[2][0] = m[6];
  ccm.matrix[2][1] = m[7];
  ccm.matrix[2][2] = m[8];
  return esp_isp_ccm_configure(_proc, &ccm) == ESP_OK;
}

bool ESP32P4_Isp::applyLsc(float ct) {
  if (!_proc || !_ipa || !_ipa->lsc || !_ipa->lsc->ch) return false;
  const Esp32p4IpaLsc *L = _ipa->lsc;
  const uint16_t idx = esp32p4_ipa_nearest_lsc(L, ct);
  if (idx == _lsc_idx && _lsc_on) return true;

  if (!_lsc_arr.gain_r) {
    if (esp_isp_lsc_allocate_gain_array(_proc, &_lsc_arr, &_lsc_n) != ESP_OK || !_lsc_n) {
      Serial.println("CSI: ISP LSC alloc failed");
      return false;
    }
  }

  const uint32_t dw = lsc_grids(_w);
  const uint32_t dh = lsc_grids(_h);
  if (dw * dh != _lsc_n) {
    Serial.printf("CSI: ISP LSC grid mismatch %u*%u != %u\n", (unsigned)dw, (unsigned)dh,
                  (unsigned)_lsc_n);
    return false;
  }
  const uint32_t sw = lsc_grids(L->img_w);
  const uint32_t sh = lsc_grids(L->img_h);
  if (sw * sh != L->n || !L->ch[idx][0]) return false;

  auto sample = [&](const uint16_t *src, float x, float y) -> float {
    if (x < 0.f) x = 0.f;
    if (y < 0.f) y = 0.f;
    if (x > (float)(sw - 1)) x = (float)(sw - 1);
    if (y > (float)(sh - 1)) y = (float)(sh - 1);
    const uint32_t x0 = (uint32_t)x;
    const uint32_t y0 = (uint32_t)y;
    uint32_t x1 = x0 + 1;
    uint32_t y1 = y0 + 1;
    if (x1 >= sw) x1 = sw - 1;
    if (y1 >= sh) y1 = sh - 1;
    const float tx = x - (float)x0;
    const float ty = y - (float)y0;
    const float a = lsc_unpack(src[y0 * sw + x0]);
    const float b = lsc_unpack(src[y0 * sw + x1]);
    const float c = lsc_unpack(src[y1 * sw + x0]);
    const float d = lsc_unpack(src[y1 * sw + x1]);
    return a * (1.f - tx) * (1.f - ty) + b * tx * (1.f - ty) + c * (1.f - tx) * ty + d * tx * ty;
  };

  isp_lsc_gain_t *dst[4] = {_lsc_arr.gain_r, _lsc_arr.gain_gr, _lsc_arr.gain_gb, _lsc_arr.gain_b};
  for (int ch = 0; ch < 4; ch++) {
    const uint16_t *src = L->ch[idx][ch];
    for (uint32_t y = 0; y < dh; y++) {
      const float fy = (sh <= 1) ? 0.f : (float)y * (float)(sh - 1) / (float)(dh - 1);
      for (uint32_t x = 0; x < dw; x++) {
        const float fx = (sw <= 1) ? 0.f : (float)x * (float)(sw - 1) / (float)(dw - 1);
        dst[ch][y * dw + x] = lsc_pack(sample(src, fx, fy));
      }
    }
  }

  esp_isp_lsc_config_t cfg = {};
  cfg.gain_array = &_lsc_arr;
  if (esp_isp_lsc_configure(_proc, &cfg) != ESP_OK) {
    Serial.println("CSI: ISP LSC configure failed");
    return false;
  }
  if (!_lsc_on) {
    if (esp_isp_lsc_enable(_proc) != ESP_OK) {
      Serial.println("CSI: ISP LSC enable failed");
      return false;
    }
    _lsc_on = true;
  }
  _lsc_idx = idx;
  return true;
}

bool ESP32P4_Isp::applyBlc(float gain_lin) {
#if __has_include("driver/isp_blc.h")
  if (!_proc || _blc_skip) return true;
#if CONFIG_IDF_TARGET_ESP32P4
  // Hardware BLC exists only on ESP32-P4 v3.0+. v1.x (Guition M3, etc.) returns
  // ESP_ERR_NOT_SUPPORTED and must not be retried every 3A tick.
  if (!_blc_on && ESP.getChipRevision() < 300) {
    _blc_skip = true;
    Serial.printf("CSI: ISP BLC skipped (P4 rev %u, needs v3.0+)\n",
                  (unsigned)ESP.getChipRevision());
    return true;
  }
#endif
  uint16_t off[4] = {16, 16, 16, 16};
  (void)esp32p4_ipa_blc_for_gain(_ipa, gain_lin, off);
  const uint16_t key = (uint16_t)(off[0] ^ (off[1] << 4) ^ (off[2] << 8) ^ (off[3] << 12));
  if (_blc_on && key == _blc_key) return true;

  if (!_blc_on) {
    esp_isp_blc_config_t cfg = {};
    cfg.window.top_left.x = _w / 8;
    cfg.window.top_left.y = _h / 8;
    cfg.window.btm_right.x = _w > 16 ? _w - _w / 8 : _w;
    cfg.window.btm_right.y = _h > 16 ? _h - _h / 8 : _h;
    cfg.filter_enable = false;
    const bool st = _ipa && _ipa->blc_stretch;
    cfg.stretch.top_left_chan_stretch_en = st;
    cfg.stretch.top_right_chan_stretch_en = st;
    cfg.stretch.bottom_left_chan_stretch_en = st;
    cfg.stretch.bottom_right_chan_stretch_en = st;
    if (esp_isp_blc_configure(_proc, &cfg) != ESP_OK) {
      _blc_skip = true;
      Serial.println("CSI: ISP BLC not supported on this chip - skipping");
      return true;
    }
    if (esp_isp_blc_enable(_proc) != ESP_OK) {
      _blc_skip = true;
      Serial.println("CSI: ISP BLC enable failed - skipping");
      return true;
    }
    _blc_on = true;
  }
  esp_isp_blc_offset_t o = {};
  o.top_left_chan_offset = off[0];
  o.top_right_chan_offset = off[1];
  o.bottom_left_chan_offset = off[2];
  o.bottom_right_chan_offset = off[3];
  if (esp_isp_blc_set_correction_offset(_proc, &o) != ESP_OK) {
    _blc_skip = true;
    Serial.println("CSI: ISP BLC offset failed - skipping");
    return true;
  }
  _blc_key = key;
  return true;
#else
  (void)gain_lin;
  return true;
#endif
}

bool ESP32P4_Isp::startAwb() {
  if (_awb) return true;
  const Esp32p4IpaProfile *p = _ipa;
  esp_isp_awb_config_t cfg = {};
  cfg.sample_point = ISP_AWB_SAMPLE_POINT_BEFORE_CCM;
  const uint32_t x0 = _w / 8;
  const uint32_t y0 = _h / 8;
  cfg.window.top_left.x = x0;
  cfg.window.top_left.y = y0;
  cfg.window.btm_right.x = _w - x0;
  cfg.window.btm_right.y = _h - y0;
  cfg.subwindow = cfg.window;
  if (p) {
    cfg.white_patch.luminance.min = p->green_min;
    cfg.white_patch.luminance.max = (uint32_t)p->green_max * 3u;
    cfg.white_patch.red_green_ratio.min = p->rg_min;
    cfg.white_patch.red_green_ratio.max = p->rg_max;
    cfg.white_patch.blue_green_ratio.min = p->bg_min;
    cfg.white_patch.blue_green_ratio.max = p->bg_max;
  } else {
    cfg.white_patch.luminance.min = 16;
    cfg.white_patch.luminance.max = 220 * 3;
    cfg.white_patch.red_green_ratio.min = 0.32f;
    cfg.white_patch.red_green_ratio.max = 0.97f;
    cfg.white_patch.blue_green_ratio.min = 0.22f;
    cfg.white_patch.blue_green_ratio.max = 0.80f;
  }
  if (esp_isp_new_awb_controller(_proc, &cfg, &_awb) != ESP_OK) {
    _awb = nullptr;
    return false;
  }
  esp_isp_awb_cbs_t cbs = {};
  cbs.on_statistics_done = onAwb;
  if (esp_isp_awb_register_event_callbacks(_awb, &cbs, this) != ESP_OK) {
    esp_isp_del_awb_controller(_awb);
    _awb = nullptr;
    return false;
  }
  if (esp_isp_awb_controller_enable(_awb) != ESP_OK) {
    esp_isp_del_awb_controller(_awb);
    _awb = nullptr;
    return false;
  }
  if (esp_isp_awb_controller_start_continuous_statistics(_awb) != ESP_OK) {
    esp_isp_awb_controller_disable(_awb);
    esp_isp_del_awb_controller(_awb);
    _awb = nullptr;
    return false;
  }
  return true;
}

bool ESP32P4_Isp::stopAwb() {
  if (!_awb) return true;
  (void)esp_isp_awb_controller_stop_continuous_statistics(_awb);
  (void)esp_isp_awb_controller_disable(_awb);
  (void)esp_isp_del_awb_controller(_awb);
  _awb = nullptr;
  return true;
}

bool ESP32P4_Isp::startAe() {
  if (_ae) return true;
  esp_isp_ae_config_t cfg = {};
  cfg.sample_point = ISP_AE_SAMPLE_POINT_AFTER_DEMOSAIC;
  const uint32_t x0 = _w / 8;
  const uint32_t y0 = _h / 8;
  cfg.window.top_left.x = x0;
  cfg.window.top_left.y = y0;
  cfg.window.btm_right.x = _w - x0;
  cfg.window.btm_right.y = _h - y0;
  if (esp_isp_new_ae_controller(_proc, &cfg, &_ae) != ESP_OK) {
    _ae = nullptr;
    return false;
  }
  esp_isp_ae_env_detector_evt_cbs_t cbs = {};
  cbs.on_env_statistics_done = onAe;
  if (esp_isp_ae_env_detector_register_event_callbacks(_ae, &cbs, this) != ESP_OK) {
    esp_isp_del_ae_controller(_ae);
    _ae = nullptr;
    return false;
  }
  if (esp_isp_ae_controller_enable(_ae) != ESP_OK) {
    esp_isp_del_ae_controller(_ae);
    _ae = nullptr;
    return false;
  }
  if (esp_isp_ae_controller_start_continuous_statistics(_ae) != ESP_OK) {
    esp_isp_ae_controller_disable(_ae);
    esp_isp_del_ae_controller(_ae);
    _ae = nullptr;
    return false;
  }
  return true;
}

bool ESP32P4_Isp::stopAe() {
  if (!_ae) return true;
  (void)esp_isp_ae_controller_stop_continuous_statistics(_ae);
  (void)esp_isp_ae_controller_disable(_ae);
  (void)esp_isp_del_ae_controller(_ae);
  _ae = nullptr;
  return true;
}

bool ESP32P4_Isp::startHist() {
#if __has_include("driver/isp_hist.h")
  if (_hist) return true;
  if (!_proc || _w < 16 || _h < 16) return false;
  esp_isp_hist_config_t cfg = {};
  cfg.hist_mode = ISP_HIST_SAMPLING_YUV_Y;
  cfg.window.top_left.x = _w / 8;
  cfg.window.top_left.y = _h / 8;
  cfg.window.btm_right.x = _w - _w / 8;
  cfg.window.btm_right.y = _h - _h / 8;
  cfg.rgb_coefficient.coeff_r.decimal = 85;
  cfg.rgb_coefficient.coeff_g.decimal = 85;
  cfg.rgb_coefficient.coeff_b.decimal = 85;
  const uint8_t wdec[25] = {10, 10, 10, 10, 10, 10, 10, 11, 10, 10, 10, 11, 12,
                            11, 10, 10, 10, 11, 10, 10, 10, 10, 10, 10, 10};
  for (int i = 0; i < 25; i++) cfg.window_weight[i].decimal = wdec[i];
  const uint32_t thr[15] = {16, 32, 48, 64, 80, 96, 112, 128, 144, 160, 176, 192, 208, 224, 240};
  memcpy(cfg.segment_threshold, thr, sizeof(thr));
  if (esp_isp_new_hist_controller(_proc, &cfg, &_hist) != ESP_OK) {
    cfg.hist_mode = ISP_HIST_SAMPLING_RGB;
    if (esp_isp_new_hist_controller(_proc, &cfg, &_hist) != ESP_OK) {
      _hist = nullptr;
      return false;
    }
  }
  esp_isp_hist_cbs_t cbs = {};
  cbs.on_statistics_done = onHist;
  if (esp_isp_hist_register_event_callbacks(_hist, &cbs, this) != ESP_OK) {
    esp_isp_del_hist_controller(_hist);
    _hist = nullptr;
    return false;
  }
  if (esp_isp_hist_controller_enable(_hist) != ESP_OK) {
    esp_isp_del_hist_controller(_hist);
    _hist = nullptr;
    return false;
  }
  if (esp_isp_hist_controller_start_continuous_statistics(_hist) != ESP_OK) {
    esp_isp_hist_controller_disable(_hist);
    esp_isp_del_hist_controller(_hist);
    _hist = nullptr;
    return false;
  }
  return true;
#else
  return false;
#endif
}

bool ESP32P4_Isp::stopHist() {
#if __has_include("driver/isp_hist.h")
  if (!_hist) return true;
  (void)esp_isp_hist_controller_stop_continuous_statistics(_hist);
  (void)esp_isp_hist_controller_disable(_hist);
  (void)esp_isp_del_hist_controller(_hist);
  _hist = nullptr;
#endif
  return true;
}

bool ESP32P4_Isp::setAwb(bool on) {
  _awb_on = on;
  if (!_proc) return true;
  if (on) return startAwb();
  return stopAwb();
}

bool ESP32P4_Isp::setAe(bool on) {
  _ae_on = on;
  _manual_once = false;
  if (!_proc) return true;
  if (on) return startAe();
  return stopAe();
}

void ESP32P4_Isp::setAeTarget(uint8_t luma) {
  if (luma < 20) luma = 20;
  if (luma > 180) luma = 180;
  _ae_target = luma;
  _ae_user = true;
}

void ESP32P4_Isp::setEvBias(int half_stops) {
  if (half_stops < -4) half_stops = -4;
  if (half_stops > 4) half_stops = 4;
  _ev_bias = half_stops;
}

void ESP32P4_Isp::setAntiFlicker(uint8_t hz) {
  _ac_hz = (hz == 50 || hz == 60) ? hz : 0;
}

void ESP32P4_Isp::setAeLimits(uint16_t exp_min, uint16_t exp_max, uint16_t gain_min,
                              uint16_t gain_max) {
  if (exp_min < 4) exp_min = 4;
  if (exp_max < exp_min) exp_max = exp_min;
  if (gain_min < 1) gain_min = 1;
  if (gain_max < gain_min) gain_max = gain_min;
  _exp_min = exp_min;
  _exp_max = exp_max;
  _gain_min = gain_min;
  _gain_max = gain_max;
}

bool ESP32P4_Isp::setBrightness(int8_t v) {
  _brightness = v;
  return applyColor();
}

