TheZeroHz/ESP32CSI_Vision/src/cam/ESP32P4_Isp.cpp
bool ESP32P4_Isp::setContrast(uint8_t v) {
  _contrast = v;
  return applyColor();
}

bool ESP32P4_Isp::setSaturation(uint8_t v) {
  _saturation = v;
  return applyColor();
}

bool ESP32P4_Isp::setHue(uint16_t deg) {
  _hue = (uint16_t)(deg % 360);
  return applyColor();
}

static int32_t clamp_wb_1024(int32_t v) {
  if (v < 256) v = 256;
  if (v > 4096) v = 4096;
  return v;
}

bool ESP32P4_Isp::setRedBalance(int32_t v1024) {
  _rb_1024 = clamp_wb_1024(v1024);
  _user_rgain = (float)_rb_1024 / 1024.f;
  (void)setAwb(false);
  return applyCcm();
}

bool ESP32P4_Isp::setBlueBalance(int32_t v1024) {
  _bb_1024 = clamp_wb_1024(v1024);
  _user_bgain = (float)_bb_1024 / 1024.f;
  (void)setAwb(false);
  return applyCcm();
}

bool ESP32P4_Isp::setSharpness(uint8_t v) {
  _sharpness = v;
  return applySharpen();
}

bool ESP32P4_Isp::setDenoise(uint8_t v) {
  _denoise = v > 8 ? 8 : v;
  return applyBf();
}

bool ESP32P4_Isp::applyBf() {
  if (!_proc) return false;
  const Esp32p4IpaProfile *p = _ipa;
  esp_isp_bf_config_t bf = {};
  bf.padding_mode = ISP_BF_EDGE_PADDING_MODE_SRND_DATA;
  bf.denoising_level = _denoise;
  if (_bf_user) {
    memcpy(bf.bf_template, _bf_mat, 9);
  } else if (p && p->bf_mat) {
    memcpy(bf.bf_template, p->bf_mat, 9);
  } else {
    const uint8_t kBf[9] = {1, 2, 1, 2, 4, 2, 1, 2, 1};
    memcpy(bf.bf_template, kBf, 9);
  }
  if (esp_isp_bf_configure(_proc, &bf) != ESP_OK) return false;
  return esp_isp_bf_enable(_proc) == ESP_OK;
}

bool ESP32P4_Isp::applySharpen() {
  if (!_proc) return false;
  if (_sharpness == 0) {
    (void)esp_isp_sharpen_disable(_proc);
    return true;
  }
  const Esp32p4IpaProfile *p = _ipa;
  const float scale = (float)_sharpness / 128.f;
  float hc = (_sh_user ? _sh_hc : (p ? p->sh_hc : 2.0f)) * scale;
  float mc = (_sh_user ? _sh_mc : (p ? p->sh_mc : 1.5f)) * scale;
  if (hc > 7.9f) hc = 7.9f;
  if (mc > 7.9f) mc = 7.9f;
  esp_isp_sharpen_config_t sh = {};
  sh.h_thresh = _sh_user ? _sh_h : (p ? p->sh_h : 20);
  sh.l_thresh = _sh_user ? _sh_l : (p ? p->sh_l : 4);
  uint32_t hi = 2, hd = 16, mi = 1, md = 16;
  f_to_fixed(hc, ISP_SHARPEN_H_FREQ_COEF_INT_BITS, ISP_SHARPEN_H_FREQ_COEF_DEC_BITS, &hi, &hd);
  f_to_fixed(mc, ISP_SHARPEN_M_FREQ_COEF_INT_BITS, ISP_SHARPEN_M_FREQ_COEF_DEC_BITS, &mi, &md);
  sh.h_freq_coeff.integer = hi;
  sh.h_freq_coeff.decimal = hd;
  sh.m_freq_coeff.integer = mi;
  sh.m_freq_coeff.decimal = md;
  sh.padding_mode = ISP_SHARPEN_EDGE_PADDING_MODE_SRND_DATA;
  if (_sh_user) {
    memcpy(sh.sharpen_template, _sh_mat, 9);
  } else if (p && p->sh_mat) {
    memcpy(sh.sharpen_template, p->sh_mat, 9);
  } else {
    const uint8_t kSh[9] = {1, 2, 1, 2, 2, 2, 1, 2, 1};
    memcpy(sh.sharpen_template, kSh, 9);
  }
  if (esp_isp_sharpen_configure(_proc, &sh) != ESP_OK) return false;
  return esp_isp_sharpen_enable(_proc) == ESP_OK;
}

void ESP32P4_Isp::process(ESP32P4_Camera *cam) {
  if (!_proc || !cam) return;
  const uint32_t now = millis();
  const Esp32p4IpaProfile *p = _ipa;

  if (_awb_on && _awb_fresh && (now - _last_awb_ms) >= ESP32P4_ISP_3A_MS) {
    _awb_fresh = 0;
    _last_awb_ms = now;
    const uint32_t n = _white_n;
    const uint32_t sr = _sum_r;
    const uint32_t sg = _sum_g;
    const uint32_t sb = _sum_b;
    const uint32_t need = p && p->min_counted ? p->min_counted : 80;
    float rg = 0.f, bg = 0.f;
    bool ok = false;
#if ISP_AWB_WINDOW_X_NUM > 0 && ISP_AWB_WINDOW_Y_NUM > 0
    {
      float srg = 0.f, sbg = 0.f, sw = 0.f;
      for (int y = 0; y < ISP_AWB_WINDOW_Y_NUM; y++) {
        for (int x = 0; x < ISP_AWB_WINDOW_X_NUM; x++) {
          const uint32_t cn = _sw_n[x][y];
          const uint32_t cg = _sw_g[x][y];
          if (cn < 8 || cg == 0) continue;
          const float cr = (float)_sw_r[x][y] / (float)cn;
          const float cgg = (float)cg / (float)cn;
          const float cb = (float)_sw_b[x][y] / (float)cn;
          if (cgg < 1.f) continue;
          float crg = cr / cgg;
          float cbg = cb / cgg;
          if (esp32p4_ipa_awb_zone(p, crg, cbg) >= 5) continue;
          srg += crg * (float)cn;
          sbg += cbg * (float)cn;
          sw += (float)cn;
        }
      }
      if (sw >= (float)need * 0.25f && srg > 0.f && sbg > 0.f) {
        rg = srg / sw;
        bg = sbg / sw;
        ok = true;
      }
    }
#endif
    if (!ok && n >= need && sg > 0 && sr > 0 && sb > 0) {
      const float r = (float)sr / (float)n;
      const float g = (float)sg / (float)n;
      const float b = (float)sb / (float)n;
      rg = r / g;
      bg = b / g;
      if (esp32p4_ipa_awb_zone(p, rg, bg) < 5) ok = true;
    }
    if (ok && rg > 0.02f && bg > 0.02f) {
      esp32p4_ipa_awb_attract(p, &rg, &bg);
      const float nw = p ? p->new_w : 0.18f;
      const float pw = p ? p->prev_w : 0.82f;
      const float rs = p ? p->r_scale : 1.f;
      const float bs = p ? p->b_scale : 1.f;
      float rgn = (1.f / rg) * rs;
      float bgn = (1.f / bg) * bs;
      if (rgn < 0.5f) rgn = 0.5f;
      if (rgn > 3.2f) rgn = 3.2f;
      if (bgn < 0.5f) bgn = 0.5f;
      if (bgn > 3.2f) bgn = 3.2f;
      _rgain = _rgain * pw + rgn * nw;
      _bgain = _bgain * pw + bgn * nw;
      _ct = _ct * pw + esp32p4_ipa_ct_from_rgbg(p, rg, bg) * nw;
      (void)applyCcm();
      (void)applyLsc(_ct);
    }
  }

  if (_ae_on && _ae_fresh && (now - _last_ae_ms) >= ESP32P4_ISP_3A_MS) {
    _ae_fresh = 0;
    _last_ae_ms = now;
    unsigned sum = 0, wt = 0, hot = 0, cold = 0;
    const uint8_t hi_thr = p ? p->ae_hi_thr : 248;
    const uint8_t hi_reg = p ? p->ae_hi_reg : 4;
    const uint8_t lo_thr = p ? p->ae_lo_thr : 13;
    const uint8_t lo_reg = p ? p->ae_lo_reg : 5;
    const uint8_t *wtab = p && p->ae_wt ? p->ae_wt : nullptr;
    for (int y = 0; y < ISP_AE_BLOCK_Y_NUM && y < 5; y++) {
      for (int x = 0; x < ISP_AE_BLOCK_X_NUM && x < 5; x++) {
        unsigned v = _ae_luma[x][y];
        unsigned w = wtab ? wtab[y * 5 + x] : 1u;
        if (!w) w = 1;
        sum += v * w;
        wt += w;
        if (v >= hi_thr) hot++;
        if (v <= lo_thr) cold++;
      }
    }
    if (!wt) return;
    float luma = (float)sum / (float)wt;
    _last_luma = luma;
    if (!_manual_once) {
      uint16_t e = 0, g = 0;
      if (cam->getExposure(&e) && e >= _exp_min) _exp = e;
      if (cam->getGain(&g) && g >= _gain_min) _gain = g;
      (void)cam->setAEC(false);
      (void)cam->setAGC(false);
      _manual_once = true;
    }

    const uint32_t line_us = cam->lineTimeUs() ? cam->lineTimeUs() : 30u;
    const float exp_us = (float)_exp * (float)line_us;
    float gain_lin = (float)_gain / 16.f;
    if (gain_lin < 0.25f) gain_lin = 0.25f;
    float env = 0.f;
#if __has_include("driver/isp_hist.h")
    if (p && p->env_k > 0.f && p->env_sp && p->env_sp_n >= 16 && _hist_fresh) {
      _hist_fresh = 0;
      float conv = 0.f;
      uint32_t hn = 0;
      for (int i = 0; i < 16; i++) {
        conv += p->env_sp[i] * (float)_hist_bin[i];
        hn += _hist_bin[i];
      }
      const float denom = exp_us * gain_lin;
      if (hn && denom > 1.f) env = p->env_k * fabsf(conv) / denom;
    } else
#endif
        if (p && p->env_k > 0.f) {
      const float denom = exp_us * gain_lin;
      if (denom > 1.f) env = p->env_k * luma / denom;
    }
    _env_luma = env;

    float tgt = (float)_ae_target;
    if (p && !_ae_user) {
      if (luma < (float)p->ae_low) tgt = (float)p->ae_low;
      else if (luma > (float)p->ae_high) tgt = (float)p->ae_high;
      else tgt = (float)p->ae_target;
    }
    tgt += esp32p4_ipa_pwl_shift(p, env);
    if (_ev_bias) tgt *= powf(1.41421356f, (float)_ev_bias * 0.5f);
    if (tgt < 20.f) tgt = 20.f;
    if (tgt > 180.f) tgt = 180.f;

