TheZeroHz/ESP32CSI_Vision/src/cam/ESP32P4_Isp.cpp
    float err = tgt - luma;
    if ((int)hot >= (int)hi_reg && luma > tgt) err = (tgt * 0.85f) - luma;
    if ((int)cold >= (int)lo_reg && luma < tgt) err = (tgt * 1.10f) - luma;
    if (err > -4.0f && err < 4.0f) return;

    float ratio = tgt / (luma < 8.0f ? 8.0f : luma);
    const float inc = p && p->inc_r > 0.05f ? p->inc_r : 0.32f;
    const float dec = p && p->dec_r > 0.05f ? p->dec_r : 0.42f;
    if (ratio > 1.f) ratio = 1.f + (ratio - 1.f) * inc;
    else ratio = 1.f - (1.f - ratio) * dec;
    if (ratio > 1.8f) ratio = 1.8f;
    if (ratio < 0.55f) ratio = 0.55f;

    if (ratio > 1.0f) {
      uint32_t ne = (uint32_t)((float)_exp * ratio + 0.5f);
      if (ne > _exp_max) {
        float leftover = (float)ne / (float)_exp_max;
        _exp = _exp_max;
        uint32_t ng = (uint32_t)((float)_gain * leftover + 0.5f);
        if (ng > _gain_max) ng = _gain_max;
        _gain = (uint16_t)ng;
      } else {
        if (ne < _exp_min) ne = _exp_min;
        _exp = (uint16_t)ne;
      }
    } else {
      uint32_t ng = (uint32_t)((float)_gain * ratio + 0.5f);
      if (ng < _gain_min) {
        float leftover = (float)ng / (float)_gain_min;
        _gain = _gain_min;
        uint32_t ne = (uint32_t)((float)_exp * leftover + 0.5f);
        if (ne < _exp_min) ne = _exp_min;
        _exp = (uint16_t)ne;
      } else {
        _gain = (uint16_t)ng;
      }
    }

    const uint8_t hz = _ac_hz ? _ac_hz : (p ? p->ac_hz : 0);
    if (hz == 50 || hz == 60) {
      const uint32_t flicker_us = 1000000u / (2u * (uint32_t)hz);
      uint32_t fl = flicker_us / (line_us < 8 ? 8 : line_us);
      if (fl < 8) fl = 8;
      if (_exp > fl) {
        uint32_t n = (_exp + fl / 2) / fl;
        if (n < 1) n = 1;
        uint32_t snapped = n * fl;
        if (snapped < _exp_min) snapped = _exp_min;
        if (snapped > _exp_max) snapped = _exp_max;
        _exp = (uint16_t)snapped;
      }
    }
    (void)cam->setExposure(_exp);
    (void)cam->setGain(_gain);
    (void)applyBlc((float)_gain / 16.f);
  }
}

static void isp_clamp_win(isp_window_t *w, uint32_t W, uint32_t H) {
  if (!w || W < 32 || H < 32) return;
  if (w->top_left.x >= W) w->top_left.x = 0;
  if (w->top_left.y >= H) w->top_left.y = 0;
  if (w->btm_right.x > W) w->btm_right.x = W;
  if (w->btm_right.y > H) w->btm_right.y = H;
  w->top_left.x &= ~1u;
  w->top_left.y &= ~1u;
  w->btm_right.x &= ~1u;
  w->btm_right.y &= ~1u;
  if (w->btm_right.x < w->top_left.x + 16) {
    w->btm_right.x = w->top_left.x + 32;
    if (w->btm_right.x > W) {
      w->btm_right.x = W & ~1u;
      if (w->btm_right.x > 32) w->top_left.x = (w->btm_right.x - 32) & ~1u;
    }
  }
  if (w->btm_right.y < w->top_left.y + 16) {
    w->btm_right.y = w->top_left.y + 32;
    if (w->btm_right.y > H) {
      w->btm_right.y = H & ~1u;
      if (w->btm_right.y > 32) w->top_left.y = (w->btm_right.y - 32) & ~1u;
    }
  }
}

uint16_t ESP32P4_Isp::afMaxPos() const {
  return (_sensor == ESP32P4_SENSOR_OV5647) ? 500 : 1023;
}

bool ESP32P4_Isp::startAf() {
#if __has_include("driver/isp_af.h") && ISP_AF_WINDOW_NUM > 0
  if (_af) return true;
  if (!_proc || _w < 32 || _h < 32) return false;
  uint32_t ww, hh, l, t;
  if (_sensor == ESP32P4_SENSOR_OV5647) {
    l = 680u * _w / 1920u;
    t = 300u * _h / 1080u;
    ww = 390u * _w / 1920u;
    hh = 410u * _h / 1080u;
  } else {
    ww = _w / 3;
    hh = _h / 3;
    l = (_w - ww) / 2;
    t = (_h - hh) / 2;
  }
  if (ww < 32) ww = 32;
  if (hh < 32) hh = 32;
  esp_isp_af_config_t cfg = {};
  cfg.edge_thresh = (_sensor == ESP32P4_SENSOR_OV5647) ? 32 : 128;
  cfg.window[0].top_left.x = l;
  cfg.window[0].top_left.y = t;
  cfg.window[0].btm_right.x = l + ww;
  cfg.window[0].btm_right.y = t + hh;
  const uint32_t shift = ww / 2;
  cfg.window[1].top_left.x = (l > shift) ? l - shift : 0;
  cfg.window[1].top_left.y = t;
  cfg.window[1].btm_right.x = cfg.window[1].top_left.x + ww;
  cfg.window[1].btm_right.y = t + hh;
  cfg.window[2].top_left.x = l + shift;
  cfg.window[2].top_left.y = t;
  cfg.window[2].btm_right.x = cfg.window[2].top_left.x + ww;
  cfg.window[2].btm_right.y = t + hh;
  for (int i = 0; i < ISP_AF_WINDOW_NUM && i < 3; i++) isp_clamp_win(&cfg.window[i], _w, _h);
  if (esp_isp_new_af_controller(_proc, &cfg, &_af) != ESP_OK) {
    _af = nullptr;
    return false;
  }
  if (esp_isp_af_controller_enable(_af) != ESP_OK) {
    (void)esp_isp_del_af_controller(_af);
    _af = nullptr;
    return false;
  }
  return true;
#else
  return false;
#endif
}

bool ESP32P4_Isp::stopAf() {
#if __has_include("driver/isp_af.h")
  if (!_af) return true;
  (void)esp_isp_af_controller_disable(_af);
  (void)esp_isp_del_af_controller(_af);
  _af = nullptr;
#endif
  return true;
}

uint32_t ESP32P4_Isp::afScore() {
#if __has_include("driver/isp_af.h") && ISP_AF_WINDOW_NUM > 0
  if (!_af) return 0;
  isp_af_result_t r{};
  if (esp_isp_af_controller_get_oneshot_statistics(_af, 80, &r) != ESP_OK) return 0;
  static const uint8_t kWt[3] = {4, 1, 1};
  uint32_t s = 0;
  for (int i = 0; i < ISP_AF_WINDOW_NUM && i < 3; i++) {
    if (r.luminance[i] < 12) continue;
    int d = r.definition[i];
    if (d < 0) d = 0;
    s += (uint32_t)d * kWt[i];
  }
  return s;
#else
  return 0;
#endif
}

#if __has_include("esp_video_isp_ioctl.h")
#include "esp_video_isp_ioctl.h"

bool ESP32P4_Isp::exportV4l2Stats(esp_video_isp_stats_t *out) const {
  if (!out || !_proc) return false;
  memset(out, 0, sizeof(*out));
  static uint32_t s_seq = 0;
  out->seq = ++s_seq;
  out->flags = ESP_VIDEO_ISP_STATS_FLAG_AE | ESP_VIDEO_ISP_STATS_FLAG_AWB;
  if (_ae_fresh) {
    for (int y = 0; y < ISP_AE_BLOCK_Y_NUM; y++) {
      for (int x = 0; x < ISP_AE_BLOCK_X_NUM; x++) {
        out->ae.ae_result.luminance[x][y] = _ae_luma[x][y];
      }
    }
  }
  out->awb.awb_result.white_patch_num = _white_n;
  out->awb.awb_result.sum_r = _sum_r;
  out->awb.awb_result.sum_g = _sum_g;
  out->awb.awb_result.sum_b = _sum_b;
  if (_af) out->flags |= ESP_VIDEO_ISP_STATS_FLAG_AF;
#if __has_include("driver/isp_hist.h")
  if (_hist) out->flags |= ESP_VIDEO_ISP_STATS_FLAG_HIST;
#endif
  return true;
}

bool ESP32P4_Isp::importV4l2Cid(uint32_t id, const void *data, size_t size) {
  if (!_proc || !data) return false;
  switch (id) {
    case V4L2_CID_USER_ESP_ISP_CCM: {
      if (size < sizeof(esp_video_isp_ccm_t)) return false;
      auto *c = (const esp_video_isp_ccm_t *)data;
      if (!c->enable) {
        _ccm_user = false;
        return applyCcm();
      }
      _ccm_user = true;
      memcpy(_ccm_m, c->matrix, sizeof(_ccm_m));
      return applyCcm() && esp_isp_ccm_enable(_proc) == ESP_OK;
    }
    case V4L2_CID_USER_ESP_ISP_GAMMA: {
      if (size < sizeof(esp_video_isp_gamma_t)) return false;
      auto *g = (const esp_video_isp_gamma_t *)data;
      if (!g->enable) {
        (void)esp_isp_gamma_disable(_proc);
        return true;
      }
      isp_gamma_curve_points_t pts = {};
      for (int i = 0; i < ISP_GAMMA_CURVE_POINTS_NUM; i++) {
        pts.pt[i].x = g->points[i].x;
        pts.pt[i].y = g->points[i].y;
      }
      if (esp_isp_gamma_configure(_proc, COLOR_COMPONENT_R, &pts) != ESP_OK) return false;
      if (esp_isp_gamma_configure(_proc, COLOR_COMPONENT_G, &pts) != ESP_OK) return false;
      if (esp_isp_gamma_configure(_proc, COLOR_COMPONENT_B, &pts) != ESP_OK) return false;
      return esp_isp_gamma_enable(_proc) == ESP_OK;
    }
    case V4L2_CID_USER_ESP_ISP_BF: {
      if (size < sizeof(esp_video_isp_bf_t)) return false;
      auto *b = (const esp_video_isp_bf_t *)data;
      if (!b->enable) {
        (void)esp_isp_bf_disable(_proc);
        return true;
      }
      _bf_user = true;
      _denoise = b->level > 8 ? 8 : b->level;
      memcpy(_bf_mat, b->matrix, 9);
      return applyBf();
    }
    case V4L2_CID_USER_ESP_ISP_SHARPEN: {
      if (size < sizeof(esp_video_isp_sharpen_t)) return false;
      auto *s = (const esp_video_isp_sharpen_t *)data;
      if (!s->enable) {
        _sharpness = 0;
        return applySharpen();
      }
      _sh_user = true;
      _sh_h = s->h_thresh;
      _sh_l = s->l_thresh;
      _sh_hc = s->h_coeff;
      _sh_mc = s->m_coeff;
      memcpy(_sh_mat, s->matrix, 9);
      if (_sharpness == 0) _sharpness = 128;
      return applySharpen();
    }
    case V4L2_CID_USER_ESP_ISP_DEMOSAIC: {
      if (size < sizeof(esp_video_isp_demosaic_t)) return false;
      auto *d = (const esp_video_isp_demosaic_t *)data;
      _dm_grad = d->gradient_ratio > 0.01f ? d->gradient_ratio : 1.5f;
      esp_isp_demosaic_config_t dm = {};
      dm.padding_mode = ISP_DEMOSAIC_EDGE_PADDING_MODE_SRND_DATA;
      uint32_t gi = 1, gd = 8;
      f_to_fixed(_dm_grad, ISP_DEMOSAIC_GRAD_RATIO_INT_BITS, ISP_DEMOSAIC_GRAD_RATIO_DEC_BITS, &gi,
                 &gd);
      dm.grad_ratio.integer = gi;
      dm.grad_ratio.decimal = gd;
      if (esp_isp_demosaic_configure(_proc, &dm) != ESP_OK) return false;
      return d->enable ? (esp_isp_demosaic_enable(_proc) == ESP_OK)
                       : (esp_isp_demosaic_disable(_proc) == ESP_OK);
    }
    case V4L2_CID_USER_ESP_ISP_WB: {
      if (size < sizeof(esp_video_isp_wb_t)) return false;
      auto *w = (const esp_video_isp_wb_t *)data;
      if (!w->enable) return setAwb(true);
      (void)setAwb(false);
      return setRedBalance((int32_t)(w->red_gain * 1024.f)) &&
             setBlueBalance((int32_t)(w->blue_gain * 1024.f));
    }
    case V4L2_CID_USER_ESP_ISP_LSC: {
      if (size < sizeof(esp_video_isp_lsc_t)) return false;
      auto *l = (const esp_video_isp_lsc_t *)data;
      if (!l->enable) {
        if (_lsc_on) {
          (void)esp_isp_lsc_disable(_proc);
          _lsc_on = false;
        }
        return true;
      }
      if (!l->gain_r || !l->lsc_gain_size) return applyLsc(_ct);
      if (!_lsc_arr.gain_r) {
        if (esp_isp_lsc_allocate_gain_array(_proc, &_lsc_arr, &_lsc_n) != ESP_OK) return false;
      }
      if (l->lsc_gain_size != _lsc_n) return false;
      memcpy(_lsc_arr.gain_r, l->gain_r, _lsc_n * sizeof(isp_lsc_gain_t));
      if (l->gain_gr) memcpy(_lsc_arr.gain_gr, l->gain_gr, _lsc_n * sizeof(isp_lsc_gain_t));
      if (l->gain_gb) memcpy(_lsc_arr.gain_gb, l->gain_gb, _lsc_n * sizeof(isp_lsc_gain_t));
      if (l->gain_b) memcpy(_lsc_arr.gain_b, l->gain_b, _lsc_n * sizeof(isp_lsc_gain_t));
      esp_isp_lsc_config_t lcfg = {};
      lcfg.gain_array = &_lsc_arr;
      if (esp_isp_lsc_configure(_proc, &lcfg) != ESP_OK) return false;
      if (!_lsc_on && esp_isp_lsc_enable(_proc) == ESP_OK) _lsc_on = true;
      return _lsc_on;
    }
    case V4L2_CID_USER_ESP_ISP_AF: {
      if (size < sizeof(esp_video_isp_af_t)) return false;
      auto *a = (const esp_video_isp_af_t *)data;
      if (!a->enable) return stopAf();
      (void)stopAf();
      return startAf();
    }
    case V4L2_CID_USER_ESP_ISP_AWB: {
      if (size < sizeof(esp_video_isp_awb_t)) return false;
      auto *a = (const esp_video_isp_awb_t *)data;
      if (!a->enable) return setAwb(false);
      return setAwb(true);
    }
    case V4L2_CID_USER_ESP_ISP_BLC: {
      if (size < sizeof(esp_video_isp_blc_t)) return false;
      auto *b = (const esp_video_isp_blc_t *)data;
#if __has_include("driver/isp_blc.h")
      _blc_off[0] = b->top_left_offset;
      _blc_off[1] = b->top_right_offset;
      _blc_off[2] = b->bottom_left_offset;
      _blc_off[3] = b->bottom_right_offset;
      _blc_stretch = b->stretch_enable;
      _blc_key = 0xffff;
      if (!b->enable) {
        if (_blc_on) {
          (void)esp_isp_blc_disable(_proc);
          _blc_on = false;
        }
        return true;
      }
      return applyBlc(_gain > 16 ? (float)_gain / 16.f : 1.f);
#else
      (void)b;
      return false;
#endif
    }
    default:
      return false;
  }
}

bool ESP32P4_Isp::exportV4l2Cid(uint32_t id, void *data, size_t size) const {
  if (!data) return false;
  switch (id) {
    case V4L2_CID_USER_ESP_ISP_CCM: {
      if (size < sizeof(esp_video_isp_ccm_t)) return false;
      auto *c = (esp_video_isp_ccm_t *)data;
      memset(c, 0, sizeof(*c));
      c->enable = true;
      memcpy(c->matrix, _ccm_m, sizeof(_ccm_m));
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_GAMMA: {
      if (size < sizeof(esp_video_isp_gamma_t)) return false;
      auto *g = (esp_video_isp_gamma_t *)data;
      memset(g, 0, sizeof(*g));
      g->enable = true;
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_BF: {
      if (size < sizeof(esp_video_isp_bf_t)) return false;
      auto *b = (esp_video_isp_bf_t *)data;
      memset(b, 0, sizeof(*b));
      b->enable = true;
      b->level = _denoise;
      memcpy(b->matrix, _bf_mat, 9);
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_SHARPEN: {
      if (size < sizeof(esp_video_isp_sharpen_t)) return false;
      auto *s = (esp_video_isp_sharpen_t *)data;
      memset(s, 0, sizeof(*s));
      s->enable = _sharpness > 0;
      s->h_thresh = _sh_h;
      s->l_thresh = _sh_l;
      s->h_coeff = _sh_hc;
      s->m_coeff = _sh_mc;
      memcpy(s->matrix, _sh_mat, 9);
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_DEMOSAIC: {
      if (size < sizeof(esp_video_isp_demosaic_t)) return false;
      auto *d = (esp_video_isp_demosaic_t *)data;
      memset(d, 0, sizeof(*d));
      d->enable = true;
      d->gradient_ratio = _dm_grad;
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_WB: {
      if (size < sizeof(esp_video_isp_wb_t)) return false;
      auto *w = (esp_video_isp_wb_t *)data;
      memset(w, 0, sizeof(*w));
      w->enable = !_awb_on;
      w->red_gain = (float)_rb_1024 / 1024.f;
      w->blue_gain = (float)_bb_1024 / 1024.f;
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_LSC: {
      if (size < sizeof(esp_video_isp_lsc_t)) return false;
      auto *l = (esp_video_isp_lsc_t *)data;
      memset(l, 0, sizeof(*l));
      l->enable = _lsc_on;
      l->gain_r = _lsc_arr.gain_r;
      l->gain_gr = _lsc_arr.gain_gr;
      l->gain_gb = _lsc_arr.gain_gb;
      l->gain_b = _lsc_arr.gain_b;
      l->lsc_gain_size = _lsc_n;
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_AF: {
      if (size < sizeof(esp_video_isp_af_t)) return false;
      auto *a = (esp_video_isp_af_t *)data;
      memset(a, 0, sizeof(*a));
      a->enable = _af != nullptr;
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_AWB: {
      if (size < sizeof(esp_video_isp_awb_t)) return false;
      auto *a = (esp_video_isp_awb_t *)data;
      memset(a, 0, sizeof(*a));
      a->enable = _awb_on;
      return true;
    }
    case V4L2_CID_USER_ESP_ISP_BLC: {
      if (size < sizeof(esp_video_isp_blc_t)) return false;
      auto *b = (esp_video_isp_blc_t *)data;
      memset(b, 0, sizeof(*b));
      b->enable = _blc_on;
      b->stretch_enable = _blc_stretch;
      b->top_left_offset = _blc_off[0];
      b->top_right_offset = _blc_off[1];
      b->bottom_left_offset = _blc_off[2];
      b->bottom_right_offset = _blc_off[3];
      return true;
    }
    default:
      return false;
  }
}
#endif
